-- 1.	получить список всех актеров, снимающихся на заданной киностудии; --

WITH [Код_заданной_киностудии] AS  ( 
	SELECT [Код_киностудии] 
	FROM [Киностудия] 
	WHERE [Название]='Columbia Pictures'
),
[Коды_искомых_актёров] AS (
	SELECT [Код_актёра] 
	FROM [Контракты]
	WHERE [Код_киностудии] IN (SELECT * FROM [Код_заданной_киностудии] )
)
SELECT [А].* 
FROM [Коды_искомых_актёров] AS [КИА] 
INNER JOIN [Актёр] AS [А] 
ON  [КИА].[Код_актёра]=[А].[Код_актёра]

GO

-- 2.	получить список кинофильмов, в которых снимаются те же актеры, что и в заданном кинофильме; --


WITH [Заданный_фильм] AS (
	SELECT [Код_фильма] 
	FROM [Фильм] 
	WHERE [Название]='Гудбай Америка'
), 
[Все_актёры_фильма] AS (
	SELECT [Код_актёра] 
	FROM (
		SELECT [АФ].*
		FROM [Заданный_фильм] AS [ЗФ] 
		INNER JOIN [Актёр_Фильм] AS [АФ] 
			ON [ЗФ].[Код_фильма]=[АФ].[Код_фильма]
	) AS [Коды_актёров_фильма]
),
[Коды_искомых_фильмов] AS (
	SELECT [Код_фильма] 
	FROM (
		SELECT [АФ].* 
		FROM [Все_актёры_фильма] AS [А] 
		INNER JOIN [Актёр_Фильм] AS [АФ] 
			ON [А].[Код_актёра]=[АФ].[Код_актёра]
	) AS [КФ]
	GROUP BY [Код_фильма] 
)
SELECT [Ф].* 
FROM [Фильм] AS [Ф] 
INNER JOIN [Коды_искомых_фильмов] AS [КИФ] 
	ON [КИФ].[Код_фильма]=[Ф].[Код_фильма]

GO

USE FilmLibrary
-- 3.	получить пары (Ф.И.О. актера, № контракта), занятых в фильмах, выпущенных на заданной киностудии; --

WITH [Код_заданной_киностудии] AS  ( 
	SELECT [Код_киностудии]
	FROM [Киностудия] 
	WHERE [Название]='Columbia Pictures'
), 
[Коды_фильмов_киностудии] AS (
	SELECT [Код_фильма] 
	FROM (
		SELECT [КФ].*
		FROM [Код_заданной_киностудии] AS [КЗК]
		INNER JOIN [Киностудия_Фильм] AS [КФ]
			ON [КЗК].[Код_киностудии]=[КФ].[Код_киностудии]
	) AS [КФФ]
), 
[Коды_актёров_фильмов] AS (
	SELECT [Код_актёра] 
	FROM [Коды_фильмов_киностудии] AS [КФК] 
	INNER JOIN [Актёр_Фильм] AS [АФ] 
		ON [КФК].[Код_фильма]=[АФ].[Код_фильма]
)
SELECT [ФИО], [Номер_контракта]
FROM [Коды_актёров_фильмов] AS [КАФ]
INNER JOIN [Актёр] AS [А]
	ON [КАФ].[Код_актёра]=[А].[Код_актёра]
INNER JOIN [Контракты] AS [К]
	ON [А].[Код_актёра]=[К].[Код_актёра]

GO

-- 4.	получить список киностудий, в которых были сняты фильмы по заданной тематике; --

WITH [Коды_заданных_фильмов] AS  ( 
	SELECT [Код_фильма] 
	FROM [Фильм] 
	WHERE [Жанр]='Комедия'
),
[Коды_искомых _киностудий] AS  ( 
	SELECT [Код_киностудии] 
	FROM [Коды_заданных_фильмов] AS [КЗФ]
	INNER JOIN [Киностудия_Фильм] AS [КФ]
		ON [КЗФ].[Код_фильма]=[КФ].[Код_фильма]
)
SELECT [К].*
FROM [Коды_искомых _киностудий] AS [КИК]
INNER JOIN [Киностудия] AS [К]
	ON [КИК].[Код_киностудии]=[К].[Код_киностудии]
GO

-- 5.	получить список актеров, у которых имеется контракт с киностудией, расположенной в том же городе, в каком проживают эти актеры; --

SELECT [А].[Код_актёра], [ФИО], [Дата_рождения],  [Город_проживания] 
FROM [Актёр] AS [А]
INNER JOIN [Контракты] AS [Ктр]
	ON [А].[Код_актёра]=[Ктр].[Код_актёра]
INNER JOIN [Киностудия] AS [Кино]
	ON [Ктр].[Код_киностудии]=[Кино].[Код_киностудии]
WHERE [Город_проживания]=[Город_расположения]

GO

-- 6.	получить список кинофильмов, в которых заданный актер не снялся ни разу. --

WITH [Коды_всех_фильмов_актёра] AS  ( 
	SELECT [Код_фильма] 
	FROM [Актёр] AS [А]
	INNER JOIN [Актёр_Фильм] AS [АФ]
		ON [А].[Код_актёра]=[АФ].[Код_актёра]
	WHERE [ФИО]='Дмитрий Владимирович Нагиев'
)
SELECT *
FROM [Фильм]
WHERE [Код_фильма] NOT IN 
	(SELECT [Код_фильма] FROM [Коды_всех_фильмов_актёра])

GO